# FailureDefinitionId Operators

---
The FailureDefinitionId type exposes the following members.
| Name| Description
---|---|---
| Equality(FailureDefinitionId, FailureDefinitionId)| Compares two FailureDefinitionId instances.
| Inequality(FailureDefinitionId, FailureDefinitionId)| Compares two FailureDefinitionId instances.
Top
#### Reference
FailureDefinitionId Class
Autodesk.Revit.DB Namespace